# 4. Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді
# коду Морзе та виводить декодоване значення (латинськими літерами).
#   Особливості:
#    - використовуються лише крапки, тире і пробіли (.- )
#    - один пробіл означає нову літеру
#    - три пробіли означають нове слово
#    - результат може бути case-insensitive (на ваш розсуд - великими
# чи маленькими літерами).
#    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки
# тощо використовуватися не будуть. Лише латинські літери.
#    - додайте можливість декодування сервісного сигналу SOS (...---...)
#    Приклад:
#    --. . . -.- .... ..-- -...   .. ...   .... . .-. .
#    результат: GEEKHUB IS HERE

def decode(morse_code):

   lat_code = {
      "A": ".-",
      "B": "-...",
      "C": "-.-.",
      "D": "-..",
      "E": ".",
      "F": "..-.",
      "G": "--.",
      "H": "....",
      "I": "..",
      "J": ".---",
      "K": "-.-",
      "L": ".-..",
      "M": "--",
      "N": "-.",
      "O": "---",
      "P": ".--.",
      "Q": "--.-",
      "R": ".-.",
      "S": "...",
      "T": "-",
      "U": "..--",
      "V": "...-",
      "W": ".--",
      "X": "-..-",
      "Y": "-.--",
      "Z": "--..",
      " ": "SPACE",
      "SOS": "...---...",
      }

   items = {v: k for k, v in lat_code.items()}
   lat = morse_code.replace("   ", " SPACE ").split(" ")
   result = "".join(items[i] for i in lat)
   return result

print(decode("--. . . -.- .... ..-- -...   .. ...   .... . .-. ."))
print(decode("...---..."))