# 6. Написати функцію, яка буде реалізувати логіку циклічного зсуву
# елементів в списку. Тобто функція приймає два аргументи: список і
# величину зсуву (якщо ця величина додатна - пересуваємо з кінця на
# початок, якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
#   Наприклад:
#  fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
#  fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]


def landslide(shift):
	lded = list1[-shift:] + list1[:-shift]
	return lded

list1 = [1, 2, 3, 4, 5]
a = int(input(":"))
print(landslide(a))

