# 2. Написати функцію <bank> , яка працює за наступною логікою:
# користувач робить вклад у розмірі <a> одиниць строком на <years>
# років під <percents> відсотків (кожен рік сума вкладу збільшується
# на цей відсоток, ці гроші додаються до суми вкладу і в наступному 
# році на них також нараховуються відсотки). Параметр <percents> є 
# необов'язковим і має значення по замовчуванню <10> (10%). Функція
# повинна принтануть суму, яка буде на рахунку, а також її повернути
# (але округлену до копійок).

def bank(a, year, percents = 10):
	for i in range (year):
		perc = (a / 100) * percents
		a += perc
	return f"{a:.2f}"
	

a = float(input("Розмір вкладу: "))
year = int(input("На скільки років: "))
print(bank(a,year))
